[
  {
    "id": "doc0",
    "content": "Before going to the beginner calisthenics skills, it's best to start simple You'll need to nail these moves first: • 10 push-ups (pushing) • 5 pull-ups (pulling) • 5 dips (upper body stability) • 10 leg raises (core control) • 10 squats (leg movement) Think of these as your checkpoints."
  },
  {
    "id": "doc1",
    "content": "These are the correct form for exercises. Push Ups: (Sagging Hips, keeping your body straight prevents hip drop, elbow flaring, keep elbows close to your sides, incomplete range, go all the way down and up, head position, look straight, don't drop your head) Pull Ups: (Using Momentum - Avoid swinging, use controlled movement, neglecting scapula , start with shoulder blades down, partial Range, reach full height, lower completely, gripping incorrectly, proper hand placement is key). Dips: (Shoulder Shrugging, keep shoulders down, elbow flaring, elbows close to your body, overarching Back, maintain a neutral back, limited Range, go down until elbows are at 90 degrees) Leg Raises (Don't use momentum, lift with core, not swings. Bending Knees, Keep legs straight throughout. Lifting Hips – Hips stay down, legs lift. Lack of Control – Lower legs slowly, controlled) Squats: (Knee Overextension – Keep knees behind toes. Leaning Forward – Stay upright, avoid leaning. Heel Lifting – Keep heels on the ground. Shallow Squats – Go deep for full benefit.)"
  },
  {
    "id": "doc2",
    "content": "Planche is an advanced calisthenics move requiring significant shoulder and core strength. To perform a planche, start in a push-up position, then lean forward shifting your weight until your feet lift off the ground, maintaining a straight body position parallel to the ground. Progression exercises include planche leans, tuck planche, advanced tuck, straddle planche, and full planche."
  },
  {
    "id": "doc3",
    "content": "Week 1 – Getting Started In the first week, the goal is to build a foundation by practicing basic holds, knee raises, and wall compressions. Work on endurance and control. Workout Plan: L-Sit Floor Hold – Hold yourself up on the floor with straight legs. Start with easier percentages (50%-80%) of your max hold time. L-Sit Floor Leg Switches – Lift one leg at a time while maintaining the L-Sit position. Wall Compressions – Sit with your back against a wall, legs straight, and try to lift your legs off the ground for short holds. Knee Raises – Either hanging from a bar or seated, lift your knees toward your chest to strengthen your core. Example workout structure: Each session consists of 4 sets with reps or hold times progressing across sets. Week 2 – Building Strength This week introduces tuck L-Sits and standing compressions to improve hip flexor and core strength. Workout Plan: Tuck L-Sit – Instead of keeping your legs straight, tuck them into your chest while holding yourself up. This makes it easier but still challenges the core. Wall Compressions – Same as before, but try holding for longer. Standing Compressions – Stand upright and try to lift your legs as high as possible, engaging the hip flexors. L-Sit Floor Hold – Continue building endurance in this position. Week 3 – Intermediate Level The focus now shifts to more dynamic L-Sit variations, such as switching legs and working on endurance. Workout Plan: One-Leg L-Sit Switches – Hold one leg extended while tucking the other, then switch. Hanging Knee Raises – Strengthen the core by raising your knees while hanging from a bar. Knee Raises – Continue practicing leg lifts for endurance. Week 4 – Advanced Progressions By this point, you're working toward a full L-Sit with longer holds. The sessions become more intense. Workout Plan: Straddle L-Sit – Instead of keeping the legs together, spread them apart while holding the L-Sit. This challenges your flexibility and strength. Hanging Knee Raises & Floor Knee Raises – Continue improving core endurance. Week 5 – Full L-Sit Mastery This week is all about maximizing your L-Sit hold time. Every session focuses on pushing yourself to hold the position for as long as possible. Workout Plan: L-Sit Hold (100% Effort) – Hold the L-Sit for as long as possible for 3 sets."
  },
  {
    "id": "doc4",
    "content": "How to do the pull up.Hands placed slightly over shoulder width. Keep scapula slightly retracted during the pullup. After each rep go back to dead hang and reactivate scapula. Core engaged, prevents swinging. Chin should clear bar in a neutral head position. Aim to get your chest as close to the bar as possible. Control the negative"
  },
  {
    "id": "doc5",
    "content": "How to do chin ups. Hands placed slightly over shoulder width. Keep scapula slightly retracted during the chin. After each rep go back to dead hang and reactivate scapula. Core engaged, prevents swinging. Chin should clear bar in a neutral head position. Aim to get your chest as close to the bar as possible Control the negative"
  },
  {
    "id": "doc6",
    "content": "The one arm push up roadmap: Knee planks, knee push ups, neagtive push ups. Can't do those exercises, then keep practicing until you can do 10 push ups. As soon as you can do that, do decline push ups, wide push ups, close grip push ups. Then move onto 30 perfect form push ups. Cant do 30 perfectg form push ups, keep practicing these exercies (decline push ups, wide push ups, close grip push ups) until you can do 30 perfect form push ups. From 30 perfect push ups, elevated one arm push ups, negative one arm push ups, tiger bend push ups. Then after you can do those exercses ( elevated one arm push ups, negative one arm push ups, tiger bend push ups), then do half one arm push up. If you cant do half one arm push ups, keep practicing these exercises until you can do the half one arm push ups. Then move onto assisted one arm push up which is the last progression to one arm push up."
  }
]
